app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 2 LIMIT 1
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES ('Denis', 'My first comment here... :)', 2, '2011-05-19 23:44:13.929713', '2011-05-19 23:44:13.929713')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])